# PointCloudsRootPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..PointCloudsRootPath Property
Application Class See Also
---
Root path for point cloud files.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string PointCloudsRootPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PointCloudsRootPath As String
	Get
```

Visual C++
---
```text
public:
property String^ PointCloudsRootPath {
	String^ get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace